[{"Name":"First Website","Image":"1web.JPG","Link":"http://bobink.biz/royce/","Description":"I made this website back in senior year of high school for a senior project. I utilized basic HTML, CSS, and the WordPress platform to build my website. The purpose of this website was to give users a resource to look for ideas on how to better serve their community."},
{"Name":"Second Website","Image":"2web.JPG","Link":"http://students.washington.edu/royle/info343/git-started/","Description":"This website was very basic since it was the first website for my INFO 343 (client-side web development). I crafted this website purely using HTML and CSS and nothing else."},
{"Name":"Dawg Cofee","Image":"3web.JPG","Link":"http://students.washington.edu/royle/info343/dawg-coffee/","Description":"This project was a little more interesting because I had a better understanding of HTML and CSS. Furthermore, I had to encoorperate the mobile-first approach when creating this website."},
{"Name":"Police Shootings","Image":"4web.JPG","Link":"http://students.washington.edu/royle/info343/police-shooting/","Description":"For the Police Shootings project, I was utilizing the Leaflet JavaScript library to create an interactive map that allowed me to communicate important and sensitive information to my audience. I used Leaflet in comination with police shooting crowd-sourced data in which I had to learn how to request data using AJAX calls."},
{"Name":"Mouse Review","Image":"5web.JPG","Link":"http://students.washington.edu/royle/info343/crud-web-app/","Description":"In the Mouse Review project, I had to create a CRUD (create, read, update, and delete) Web Application. The Web Application I chose to do was a review website for a mouse. I was able to finish the assingment utilizing a cloud-based data storage service called Parse where users' data is saved then displayed for everyone to see."},
{"Name":"Spotify Challenge","Image":"6web.JPG","Link":"http://students.washington.edu/royle/info343/spotify-challenge/","Description":"The Spotify Challenge really tested my knowledge of all that I have learned in addition to testing my knowledge on a new library, AngularJS. For the challenge, I used Spotify API to create a web application that determine's how 'in' is one's music taste based on the popularity of their favorite song."}]